nc: 3  # number of classes
depth_multiple: 1.0  # model depth multiple
width_multiple: 1.0  # layer channel multiple
anchors:
  - [10,14, 23,27, 37,58]  # P4/16
  - [81,82, 135,169, 344,319]  # P5/32

# YOLOv3-tiny backbone
backbone:
  # [from, number, module, args]
  # args: [input_channels , , , ......]
  [[-1, 1, Conv_1, [32, 7, 2]],  # 0
   [-1, 1, Conv_1, [64, 3, 2]], #1
   [-1, 1, Concat_res2, [128, 3, 2]],
   [-1, 1, BasicBlock_2, [64, 3, 1]],
   [-1, 1, Concat_res2, [256, 3, 2]],
   [-1, 1, BasicBlock_2, [256, 3, 1]], # 5
   [-1, 1, Spiking_DenseBlock, [256, 16, 16]],
   [-1, 1, BasicBlock_2, [512, 3, 2]],
   [-1, 1, Conv_1, [512, 3, 1]],  #8 
  ]

 # YOLOv3-tiny head
head:
  [[-1, 1, Conv_1, [512, 3, 1]], #9
   [-1, 1, Conv_1, [256, 3, 1]], #10
   [-1, 1, Conv_1, [256, 1, 1]], #11
   
   [9, 1, Sample, [None, 2, 'nearest']],
   [[-1, 5], 1, Concat, [2]],  # cat backbone P4
   [-1, 1, Conv_1, [256, 3, 1]],  # 13 (P4/16-medium)
   [-1, 1, Conv_1, [256, 1, 1]], #14

   [[14, 11], 1, Detect, [nc, anchors]],  # Detect(P4, P5)
  ] 