nc: 3  # number of classes
depth_multiple: 1.0  # model depth multiple
width_multiple: 1.0  # layer channel multiple
anchors:
  - [10,14, 23,27, 37,58]  # P4/16
  - [81,82, 135,169, 344,319]  # P5/32

# YOLOv3-tiny backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Ann_Conv_1, [64, 7, 2]],  # 0
   [-1, 1, Ann_BasicBlock_2, [64, 3, 2]], #1
   [-1, 2, Ann_BasicBlock_2, [64, 3, 1]],
   # CSP contain pooling
   [-1, 1, DenseBlock, [64, 16, 4]], #3
   [-1, 1, Ann_Conv_1, [128, 3, 2]], #4
   [-1, 3, Ann_BasicBlock_2, [128, 3, 1]],
    # CSP contain pooling
   [-1, 1, DenseBlock, [128, 16, 8]], #6
   [-1, 1, Ann_Conv_1, [256, 3, 2]], #7
   [-1, 5, Ann_BasicBlock_2, [256, 3, 1]],
   [-1, 1, DenseBlock, [256, 16, 16]],
   [-1, 1, Ann_Conv_1, [512, 3, 2]], #10
   [-1, 2, Ann_BasicBlock_2, [512, 3, 1]],
 
  ]

# YOLOv3-tiny head
head:
  [[-1, 1, Ann_BasicBlock_2, [256, 3, 1]], #9
   [-1, 1, AnnConv, [512, 3, 1]],  # 10 (P5/32-large)

   [-2, 1, Ann_BasicBlock_2, [128, 1, 1]],
   [-1, 1, AnnSample, [None, 2, 'nearest']],
   [[-1, 8], 1, Concat, [2]],  # cat backbone P4
   [-1, 1, AnnConv, [256, 3, 1]],  # 14 (P4/16-medium)

   [[17, 13], 1, Detect, [nc, anchors]],  # Detect(P4, P5)
  ]